[
  {
    "about_speaker": "Siddarth is a second year CSE student and a member of the AI division at Project Manas.",
    "begin_time": "201810281715",
    "description": "Siddarth will talk about what are word vectors, how are they made? What are Recurrent neural networks? LSTM and related cells. Types of nlp tasks(classification, summarization, sequence generation etc). Illustrate easy to make models on Tensorflow-Keras.",
    "duration": "35 minutes",
    "github": "https://github.com/",
    "image": "",
    "linkedin": "",
    "location": "NLH 405",
    "speaker": "Siddarth Venkatraman",
    "speaker_email": "",
    "talk_id": "siddvenk",
    "title": "Modern approach to NLP using Recurrent Neural Networks",
    "type": "Track Two"
  },
  {
    "about_speaker": "Shayantan is a third year student at MIT studying Electrical and Electronics and am interested in object detection , analysis and its various applications using Python3, Keras, TensorFlow , Pillow among others.",
    "begin_time": "201810281630",
    "description": "The talk will elaborate and demonstrate the use of Python3 with other packages like OpenCV via 3 distinct examples - \n\nSurveillance and motion detection with the Raspberry Pi, Python, OpenCV, and Dropbox \n\nReal-Time Face Recognition \n\nObject detection with deep learning and OpenCV",
    "duration": "35 minutes",
    "github": "https://github.com/",
    "image": "",
    "linkedin": "",
    "location": "NLH 405",
    "speaker": "Shayantan Pal",
    "speaker_email": "simongobak@gmail.com",
    "talk_id": "shayapal",
    "title": "Motion Detection,Face Detection and Object Detection using OpenCV",
    "type": "Track Two"
  },
  {
    "about_speaker": "Siddhartha is a final year Computer Science student interested in Deep Learning research. He has collaborated with scientists at Google Brain to improve learning mechanisms of neural networks. He also worked with CERN as a Google Summer of Code 2018 student. He loves playing around with new ideas and is here to share.",
    "begin_time": "201810281545",
    "description": "Artificial intelligence is probably the fastest evolving field these days and it is so for a good reason. With applications ranging from Medical diagnosis to Quantum physics, AI is redefining the boundaries of computer science. The mathematical models that we use to understand the world around us are flawed and the learning algorithms are very brittle. Thanks to Python and a few frameworks, adoption of AI in the industry is prevalent. But, commercial usage without a proper understanding  of what's under the hood has  direct consequences and the outcome can get ugly. This talk would elaborate on what the problems with AI are and why we're far from the 'intelligence' part of AI.",
    "duration": "35 minutes",
    "github": "https://github.com/srk97",
    "image": "https://drive.google.com/file/d/1nmOPZSp9yxdfOgn6bK3lC0tTt3_cO8Mm/view?usp=sharing",
    "linkedin": "https://www.linkedin.com/in/siddhartha-rao-kamalakara/",
    "location": "NLH 405",
    "speaker": "Siddhartha Rao Kamalakara",
    "speaker_email": "srk97c@gmail.com",
    "talk_id": "srkamal",
    "title": "Problems with Deep Learning",
    "type": "Track Two"
  },
  {
    "about_speaker": "Coming up soon!",
    "begin_time": "201810281015",
    "description": "Coming up soon!",
    "duration": "35 minutes",
    "github": "https://github.com/",
    "image": "",
    "linkedin": "",
    "location": "NLH 405",
    "speaker": "Lakshay Kalbhor",
    "speaker_email": "lakshaykalbhor@gmail.com",
    "talk_id": "kalbhoro",
    "title": "Daemonizing Python Applications",
    "type": "Track Two"
  },
  {
    "about_speaker": "Manish Agnihotri is a 4th year CCE student who has researched in the field of Computer Vision and Continual Learning. He is also the co-founder of Research Lab, Manipal's first collaborative research club.",
    "begin_time": "201810280930",
    "description": "Computer programs that learn to perform tasks also typically forget them very quickly. Continual Learning is being able to train your model in a way that takes into account different tasks and different data distributions at once and is able to retain all that knowledge. This is an important step towards more intelligent programs that are able to learn progressively and adaptively. We will discuss the basics, the current state of the art and the future challenges followed by a demonstration.",
    "duration": "35 minutes",
    "github": "https://github.com/ambicorp",
    "image": "https://preview.ibb.co/jL5g3A/Whats-App-Image-2018-10-24-at-23-05-48.jpg",
    "linkedin": "http://www.linkedin.com/in/manish-agnihotri-50b9ab135",
    "location": "NLH 405",
    "speaker": "Manish Agnihotri",
    "speaker_email": "ambicorp.manish@gmail.com",
    "talk_id": "maniagni",
    "title": "Continual Learning: Key to Machine Intelligence",
    "type": "Track Two"
  },
  {
    "about_speaker": "Shaurya is passionate about learning new skills, and has working knowledge of 30+ programming languages across multiple domains varying from OS development to Web/Application development and now developing Deep Learning solutions. As an expert in neural networks, Shaurya has delivered deep learning solutions for retail sales predictions, customer churn model and user behavior analysis.",
    "begin_time": "201810280930",
    "description": "Through this talk, Shaurya will showcase the extensive applications of python across various domains with focus in Data Science, Machine Learning and Deep Learning. He will give an insight into Neural Networks, working of CNN, libraries like TensorFlow, Keras, openCV and PIL.",
    "duration": "60 minutes",
    "github": "https://github.com",
    "image": "https://media.licdn.com/dms/image/C5103AQFfJIe1pjsK0A/profile-displayphoto-shrink_800_800/0?e=1545868800&v=beta&t=rCV2nxeZW4KIQ_2MihWmhm9Vj_o0a8seV8MQo0QAP1c",
    "linkedin": "https://www.linkedin.com/in/shauryakuchhal/",
    "location": "NLH 403",
    "speaker": "Shaurya Kuchhal",
    "speaker_email": "shauryakuchhal@gmail.com",
    "talk_id": "shauryak",
    "title": "Convolution Neural Networks in Keras",
    "type": "Track One"
  },
  {
    "about_speaker": "Abhishek is presently working as Deep Learning Scientist at Predible Health.\n\nThey have build state of the art segmentation network for liver and tumour and vessel segmentations.\n\nHe has spoken at Shri Mata Vaishno Devi University at their SFD celebrations and will also be submitting a proposal at PyCon India.\n\nHe has been a constant contributor in the open source world and a regular attendee of PyCon and other conferences every year.",
    "begin_time": "201810281200",
    "description": "Coming up soon!",
    "duration": "60 minutes",
    "github": "https://github.com/vibrantabhi19",
    "image": "https://avatars3.githubusercontent.com/u/6832471?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/abhishek-kumar-74299887/",
    "location": "NLH 403",
    "speaker": "Abhishek Kumar",
    "speaker_email": "abhishek@prediblehealth.com",
    "talk_id": "abhikumr",
    "title": "Exploring PyTorch to dive into the world of Computer Vision",
    "type": "Track One"
  },
  {
    "about_speaker": "Aabir is a researcher, currently at the Tata Institute of Fundamental Research in India. With an interdisciplinary background in engineering, physics, data science and social science, he enjoys tackling big problems at different scales, and is particularly fascinated by the theory of information. While not coding experiments and simulations, he enjoys playing the guitar, discussing philosophy and politics, and traveling.",
    "begin_time": "201810281045",
    "description": "Data is often high-dimensional - millions of pixels, frequencies, categories. A lot of this detail is unnecessary for data analysis - but how much exactly? This talk will discuss the basic principles and techniques of dimensionality reduction, provide (just a little!) mathematical intuition about how it's done, and use scikit-learn to show you how Netflix uses it to lead you from binge to binge.",
    "duration": "60 minutes",
    "github": "https://github.com/bakerwho",
    "image": "https://www.icts.res.in/sites/default/files/styles/people_thumbnail/public/media/people/images/Aabir-Abubaker-grid-img.jpg?itok=EdyV_fwX&c=7565903ff73648fc7d0eb6f780b8f2d9",
    "linkedin": "https://www.linkedin.com/in/aabir/",
    "location": "NLH 403",
    "speaker": "Aabir Abubaker Kar",
    "speaker_email": "aabir.abubaker.kar@gmail.com",
    "talk_id": "aabirkar",
    "title": "Dimensionality Reduction with PCA",
    "type": "Track One"
  },
  {
    "about_speaker": "Surya is a high schooler from Silicon Valley, California. He has had experience with Machine Learning, Computer Vision and has published a paper titled 'Rapid Autonomous Car Control based on Spatial and Temporal Visual Cues'. He has previously spoken at HAILCon, where he was selected to present on Generative Adversarial Networks, their implementations, variations, and fundamental concepts to understand what they are.",
    "begin_time": "201810281045",
    "description": "In this talk, Surya will give a background of Reinforcement Learning so that the audience has a basic understanding of the same. This will be followed by the uses and applications of Reinforcement Learning and an introduction to OpenAI Gym. Surya will also talk about the current reaseach opportunities in Reinforcement Learning.",
    "duration": "60 minutes",
    "github": "https://github.com/dantuluri",
    "image": "https://suryad.com/assets/images/profile.png",
    "linkedin": "https://www.linkedin.com/in/surya-d/",
    "location": "NLH 405",
    "speaker": "Surya Dantuluri",
    "speaker_email": "dsuryav@gmail.com",
    "talk_id": "surydant",
    "title": "Reinforcement Learning",
    "type": "Track Two"
  },
  {
    "about_speaker": "Saptak Sengupta is a contributor and maintainer of various open source projects. FOSSASIA, jQuery, Freedom of the Press Foundation and Gitcoin are few organizations under his belt. He is currently working as a Software Developer at Gitcoin. He is also associated with programs like Google Summer of Code, Google Code-In, and Rails Girls Summer of Code as a mentor/supervisor. As an open-source evangelist, he also likes to help out people with programming in general. His core area of dabbling is JavaScript and Python. He has previously given talks in FOSSASIA Summit, FOSSMeet, DevConf India, PyCon India Devsprint and other local meetups.",
    "begin_time": "201810281430",
    "description": "Open Source Software and Open Source contributors provide for a massive percentage of today's softwares and web and other technical ecosystems. It provides a freedom and global way of contributing to make things better. However, Open Source contributions are mostly driven by intrinsic motivations. This often leads to burn out due to lack of sustainability. Gitcoin provides a solution to help all the wonderful Open Source contributors earn by doing what they do best. Gitcoin is a bountying platform which helps bounty open source issues which now the contributors can work on and also earn and sustain themselves.",
    "duration": "60 minutes",
    "github": "https://github.com/saptaks",
    "image": "https://media.licdn.com/dms/image/C4E03AQF-NrCmMaaEQA/profile-displayphoto-shrink_200_200/0?e=1545868800&v=beta&t=itNqh8SVg2jLZvsWpDleIoFmAGQJ8rKn1kOlPZMb5ZE",
    "linkedin": "https://in.linkedin.com/in/saptaks",
    "location": "NLH 403",
    "speaker": "Saptak Sengupta",
    "speaker_email": "saptak013@gmail.com",
    "talk_id": "saptakse",
    "title": "Making Open Source Sustainable",
    "type": "Track One"
  },
  {
    "about_speaker": "Coming up soon!",
    "begin_time": "201810281430",
    "description": "Coming up soon!",
    "duration": "60 minutes",
    "github": "https://github.com/",
    "image": "",
    "linkedin": "",
    "location": "NLH 405",
    "speaker": "Sunil Kumar",
    "speaker_email": "sunil_sixsigma@yahoo.com",
    "talk_id": "sunilkmr",
    "title": "Learning to Interpret Complex Machine Learning Models",
    "type": "Track Two"
  },
  {
    "about_speaker": "Ashok is a MIT alumnus, CSE 2010-2014 batch and currently working at Honeywell as a Product Design Senior Engineer where he develops ML based Facial Recognition systems for edge devices. He is the Co-founder and CTO at Zayyon IT Labs which deals in services like Gesture Recognition for gaming devices and smart watches. Ashok has several certifications like Six Sigma Green Belt from Honeywell and Vitualization and Cloud Computing by Carnegie Mellon.",
    "begin_time": "201810281545",
    "description": "",
    "duration": "60 minutes",
    "github": "https://github.com/ashokbugude",
    "image": "https://media.licdn.com/dms/image/C5103AQGIOTk7fyVxbA/profile-displayphoto-shrink_800_800/0?e=1545868800&v=beta&t=OX7U7rBJk5VQPs9OGRAPpPp57kaXoWsT-raFBn1fKw4",
    "linkedin": "https://www.linkedin.com/in/ashokbugude/",
    "location": "NLH 403",
    "speaker": "Ashok Bugude",
    "speaker_email": "ashokbugude@gmail.com",
    "talk_id": "ashokbug",
    "title": "Face recognition using Machine Learning and Deep Neural Networks",
    "type": "Track One"
  },
  {
    "begin_time": "201810281700",
    "about_speaker": "Vinayak is a Natural Language Understanding researcher at UMass Amherst where he is a graduate student working towards a Masters degree. A proud alumnus of Manipal, Vinayak has worked on cutting-edge NLP research in academia at the Indian Institute of Science as well as in the industry at Samsung Research America & Lexalytics. His research interests include latent semantic frames, conversation agents and word sense induction which he is pursuing at the IESL lab at UMass. Vinayak has also collaborated and published with the human-computer interface group at Stanford and is an active member of the MIT Media Lab's innovation in medicine community in India. He has published multiple peer-reviewed papers and has an AI patent under review at the US PTO.",
    "description": "This talk will briefly introduce word embeddings that have become a standard representation in natural language processing. We will discuss the shortcomings of universal embeddings like word2vec and Glove and what new directions are being explored to overcome their disadvantages. The talk will give details about the new ELMo embedding model and give a general overview of how, when, and where should they be used in your NLP projects. Finally the talk will give a sneak peek into the work happening at UMass Amherst to overcome some of the problems encountered in the field.",
    "duration": "60 minutes",
    "github": "https://github.com",
    "image": "http://vinayakmathur.com/wp-content/uploads/2016/08/cropped-vin-1-300x300.jpg",
    "linkedin": "https://www.linkedin.com/in/vin101/",
    "location": "NLH 403",
    "speaker": "Vinayak Mathur",
    "speaker_email": "vinayak@cs.umass.edu",
    "talk_id": "vinayakm",
    "title": "Evolution of Word Embedding for NLP tasks",
    "type": "Track One"
  }
]