[
  {
    "talk_id": "01",
    "title": "PyCon 101",
    "speaker": "PyPals",
    "begin_time": "201610221800",
    "linkedin": "N/A",
    "github": "https://github.com/PyPals",
    "image": "https://avatars3.githubusercontent.com/u/15671027?v=3&s=200",
    "description": "N/A",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "02",
    "title": "The Road to an Open Source contributor (V)",
    "speaker": "Ratnadeep Debnath",
    "begin_time": "201610221900",
    "linkedin": "https://www.linkedin.com/in/rtnpro",
    "github": "https://github.com/rtnpro",
    "image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAIwAAAAJGI2OTRmN2QwLTg2YjEtNDg5My04YWQ3LWQzZmVmMDk2ZDMwNQ.jpg",
    "description": "This talk will take the audience through my journey of becoming an Open Source contributor. \n\nThis talk will try to explain how to start Open Source contributions by contributing, rather than traditional course studies. \n\nThis talk will also describe the various projects I have been involved with and my drive for it and what I learnt from it.\n\nIn short, this talk will help the curious listeners to be inspired to kickstart their Open Source journey.",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "03",
    "title": "PycoIn",
    "speaker": "Projjol Banerji",
    "linkedin": "https://in.linkedin.com/in/drstm",
    "github": "https://github.com/Projjol",
    "image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/6/005/09e/2f1/16e87f7.jpg",
    "description": "Bitcoin is a cryptocurrency that intends to solve the problem of having middle-men in financial transactions or banks. It allows individuals to transfer money to each other without having an intermediary source snooping in on their private transaction. \n\nBitcoin's rebellious notions put aside the real ground breaking tech that has emerged from it is the blockchain. The blockchain is central to the concept of Bitcoin as all transactions that occur over the Bitcoin network are post validation stored in the blockchain. \n\nThe height and longevity of the blockchain for any currency is a testament to the legitimacy of initial transactions. The talk is going to revolve around the central concept of the blockchain and a PoC implementation in Python.",
    "begin_time": "201610221900",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "04",
    "title": "Keynote",
    "speaker": "N/A",
    "linkedin": "N/A",
    "github": "N/A",
    "image": "https://avatars3.githubusercontent.com/u/15671027?v=3&s=200",
    "description": "N/A",
    "begin_time": "201610230900",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "05",
    "title": "Deep Learning in NLP - Powered by Python",
    "speaker": "Rishabh Shukla",
    "linkedin": "https://www.linkedin.com/in/rishabhshukla1",
    "github": "N/A",
    "image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAknAAAAJDJiODliYzVjLTNjMGItNGJjYy1iNDY2LTQxMjI2MTgzM2E5OA.jpg",
    "description": "Neuron is a Natural Language Processing Platform, which provides Deep Learning based NLP models via REST APIs. The objective is to develop a generic platform, in order to provide textual intelligence to developers around the globe.\n\nContents:\n- What we do at Neuron\n\n- A brief intro of Deep Learning and Neural Networks\n\n- Technical Stack we use for Training (Deep) Neural Networks\n\n- How things have evolved in the field of NLP within last few years, and where we stand\n\n- Some fun examples of Recurrent Neural Nets(generating Linux Code, writing Poetry, etc.)\n\n- People and online resources to follow, if you want to dive into Deep Learning\n\n- An Interactive Q&A Session",
    "begin_time": "201610231000",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "06",
    "title": "Using Django with MongoDB",
    "speaker": "Raakesh Kumar",
    "linkedin": "https://www.linkedin.com/in/rakesh-kumar-4b517813",
    "github": "N/A",
    "image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/8/005/076/220/09bff25.jpg",
    "description": "Django with MongoDB using MongoEngine\n\n- Web development with Django and MongoDB\n\n- What is Django, Architecture, model classes\n\n- Forms, Views\n\n- MongoDB, Document Model, Denormalization, Nested Queries\n\n- Comparison with RDBMS\n\n- Django with Mongo, Mongo Engine Model\n\n- Collecting things in View, Connecting to Database\n\n- When should you use MongoDB",
    "begin_time": "201610231100",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "07",
    "title": "Taking ML to production",
    "speaker": "Aakash Rajpal",
    "linkedin": "https://www.linkedin.com/in/aakash-rajpal-177369b5",
    "github": "N/A",
    "image": "https://media.licdn.com/media/AAEAAQAAAAAAAAkcAAAAJDg4OTZhY2JmLTU0NmItNGQyMi1hMmNlLTEyYjZjMmNlNjI5NA.jpg",
    "description": "The project involved developing an interactive Heads up Display (HUD) on the OCULUS RIFT for the V-ERAS Simulation (VR simulation of the Eras  Mars Station). Once the interactive semi-transparent interface is implemented  on the existing V-ERAS simulation environment it should display data from  the Habitat Monitoring Client. \n\nThe Habitat Monitoring Client GUI is already in place. The GUI needed to be integrated with the blender game engine which runs the simulation through blender python API. \n\nThe Habitat Monitoring Client can interface with any general Tango Device Server. This Device Server could be any Sensor placed on the Mars environment. The HMC could get a request from the user to poll a specific server and get the average, minimum or maximum of the values. A portion of the project was aimed at making the HUD highly interactive and recognize touchless hand and body gestures through Leap Motion Controller. \n\nThe Leap Motion Controller is able to detect Hand gestures. The Leap motion controller (LMC) will be integrated with Blender through the Leap Motion API for Python which will result in controlling simulation in Blender Game Engine (BGE) using hand movement gestures. There are four standard gestures recognized by the Leap Motion software through the Gesture Class in its Python API. \n\nThe Leap API for Python will communicate with the Blender API for Python (bpy) to feed the data from the LMC server into the BGE so that the simulation of V-ERAS can be controlled through the Leap Motion Controller using gestures.",
    "begin_time": "201610231300",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "08",
    "title": "Become a pdb power-user",
    "speaker": "Ashwini Chaudhary",
    "linkedin": "N/A",
    "github": "N/A",
    "image": "N/A",
    "description": "This talk focuses on the effective general and power usage of the interactive python debugger.",
    "begin_time": "201610231400",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "09",
    "title": "Anomaly Detection",
    "speaker": "Shreya Khurana",
    "linkedin": "https://www.linkedin.com/in/shreya-khurana-36759a86",
    "github": "https://github.com/ShreyaKhurana",
    "image": "https://media.licdn.com/media/AAEAAQAAAAAAAAYVAAAAJGRjZDUxM2IzLTkxYmQtNDYwZi1iYTBhLWY3ZDgwMTAxNjAxMA.jpg",
    "description": "From constant monitoring of data using Excel and analyzing countless graphs to developing statistical models to automate the whole procedure, we’ve come a long way in our approach to detect anomalies in processes.\n\nEver wondered why a cardiologist spends hours looking a patient’s medical history? Or why banks keep an extremely detailed track of their users’ transactions? Time series data provides an answer to how your regular processes should behave and why in some bizarre cases they do not.\n\nThis talk will be about how machine learning models are now being used to predict when the next anomaly will occur and whether the current data seems to suggest an anomaly that we’ve encountered before, with a special focus on supervised learning.\n\nI will give examples of how this is taken up by various industry sectors and explain how the same algorithms can be applied to sophisticated applications like handwriting and speech recognition. In specific, I will explain how the manufacturing sector uses data science techniques in order to give their processes and products an edge over the others.\n\nThis talk will also explore basic visualization and preliminary data analysis techniques, specific to this context, and you may see some bouts of extreme devotion towards Pandas because well, let’s admit it, that library is GOD.\n\nThe structure of the talk will be as follows:\n\n- Intro to Anomaly Detection + Applications\n- Time series analysis\n- Algorithms currently in use\n- Python libraries used\n- Code demo a. EDA: Basic techniques b. Fault detection\n- Pre-requisites\n\nBasic stats, ML and Python knowledge\nLove for Pandas (the library)",
    "begin_time": "201610231400",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "10",
    "title": "Mission Control in Mars Extraplanetary Python (V)",
    "speaker": "Mario Tambos",
    "linkedin": "https://www.linkedin.com/in/mtambos",
    "github": "N/A",
    "image": "https://media.licdn.com/media/p/2/000/016/0ad/19b2987.jpg",
    "description": "In this talk I'll talk about the experience of trying to develop open source software for the space industry, the advantages of using Python for the purpose, and the GSoC program.",
    "begin_time": "201610231500",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "11",
    "title": "Machine Learning with Python using scikit-learn",
    "speaker": "Kartik Mandaville",
    "linkedin": "https://www.linkedin.com/in/kar2905",
    "github": "https://github.com/kar2905",
    "image": "https://media.licdn.com/media/AAEAAQAAAAAAAANzAAAAJGI1NTJkZWU4LWI1NGItNDQ4MC05NzA0LWE5Njk2MWJmYWMyYQ.jpg",
    "description": "Topics to be covered in the talk:\n\n- Introduction to ML\n- Problem Setting\n- Supervised and unsupervised\n- Setup for Scikit\n- Loading a dataset\n- Training a model\n- Testing the model on unseen data\n- Classification\n- Regression",
    "begin_time": "201610231600",
    "duration": "35 minutes",
    "location": "N/A"
  },
  {
    "talk_id": "10",
    "title": "Sentiment Analysis using Word2Vec",
    "speaker": "Shubham Goel",
    "linkedin": "https://www.linkedin.com/in/shubhamgoel27",
    "github": "N/A",
    "image": "https://media.licdn.com/media/AAEAAQAAAAAAAAMaAAAAJDdhYmY4ZTBkLTE0ZTktNDVkMS1iMzk2LTIyMmE0NjRiZDZlOQ.jpg",
    "description": "The talk aims at using Word2Vec, which allows words to be represented in the form of vectors, to help predict the sentiment of a movie review.",
    "begin_time": "201610231600",
    "duration": "35 minutes",
    "location": "N/A"
  }
]