[
  {
    "about_speaker": "Aniket Maithani works at RADIOWALLA NETWORK PVT. LTD, where he handles Development & Dev-Ops. He's a B.Tech (CS&E) graduate from Amity University, Noida (UP). He loves to travel and blog during free time. He's a cricket lover, guitar player and a chai addict.",
    "begin_time": "201710221500",
    "description": "Writing \"Test\" sometimes become a trivial task with the ever increasing code base and underlying feature-set. There are major Importance of testing in the part of writing the software and it is better to introduce testing in the early stage of software development, so it help to identify the defects in the early stage & try to avoid the bugs finding & get resolve in the last critical stage.\n\nBut with time the TEST Code itself becomes quite huge that it becomes a trivial problem to write test-cases and maintain the same!\n\nProperty-based tests make statements about the output of your code based on the input, and these statements are verified for many different possible inputs. A property-based testing framework runs the same test over and over with generated input.\n\nThe talk will focus on:\n- Using Hypothesis to write property based testing\n- Using Hypothesis in CI Environment\n- Do's and Dont's while using Property Based Testing.\n\nPrerequisites:\n- Basic Python Knowledge\n- Idea about Testing Guidelines (basic)\n- Understanding of CI Environment (basic)",
    "duration": "50 minutes",
    "github": "https://github.com/aniketmaithani",
    "image": "https://avatars3.githubusercontent.com/u/920701?v=4&s=400",
    "linkedin": "https://www.linkedin.com/in/aniketmaithani/",
    "location": "NLH 103",
    "speaker": "Aniket Maithani",
    "speaker_email": "maithani.aniket@gmail.com",
    "talk_id": "anikmath",
    "title": "Property Based Testing using Hypothesis",
    "type": "Track One"
  },
  {
    "about_speaker": "Abhishek is presently working as Deep Learning Scientist at Predible Health.\n\nThey have build state of the art segmentation network for liver and tumour and vessel segmentations.\n\nHe has spoken at Shri Mata Vaishno Devi University at their SFD celebrations and will also be submitting a proposal at PyCon India.\n\nHe has been a constant contributor in the open source world and a regular attendee of PyCon and other conferences every year.",
    "begin_time": "201710211830",
    "description": "Semantic Segmentation of an image is to assign each pixel in the input image a semantic class in order to get a pixel-wise dense classification.\n\nWhile semantic segmentation/scene parsing has been a part of the computer vision community since late 2007, but much like other areas in computer vision, a major breakthrough came when fully convolutional neural networks were first used by 2014 Long et. al. to perform end-to-end segmentation of natural images.\n\nI will walk through the introduction to classification network and then summarize the methods and papers on segmentation network and also about some of the state of the art papers and how semantic segmentation is helping the world build medical and self-driving cars possible. ",
    "duration": "50 minutes",
    "github": "https://github.com/vibrantabhi19",
    "image": "https://avatars3.githubusercontent.com/u/6832471?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/abhishek-kumar-74299887/",
    "location": "NLH 203",
    "speaker": "Abhishek Kumar",
    "speaker_email": "abhishek@prediblehealth.com",
    "talk_id": "abhikumr",
    "title": "A journey to Semantic Segmentation from Classification Network",
    "type": "Track One"
  },
  {
    "about_speaker": "Sajid works as a Data Scientist with an experience of over 4 years. He teaches data science online at StepUp Analytics, be sure to take the free course on data science.",
    "begin_time": "201710221400",
    "description": "Now a days Python has become a very powerful programming language and is used for many different applications. Over time, the huge community around this open source language has created many tools to efficiently work with Python. In recent years, a number of tools have been built specifically for data science and Analytics be it be Analyzing data, visualization or data handling. As a result, analyzing data with Python has never been easier.",
    "duration": "50 minutes",
    "github": "https://github.com",
    "image": "http://www.stepupanalytics.com/wp-content/uploads/2015/11/image-1-200x200.jpeg",
    "linkedin": "https://www.linkedin.com/in/mdsajidhussain1/",
    "location": "NLH 103",
    "speaker": "Mohammad Sajid (StepUp Analytics)",
    "speaker_email": "stepupanalytics1@gmail.com",
    "talk_id": "stepupan",
    "title": "Python for Data Science",
    "type": "Track One"
  },
  {
    "begin_time": "201710211630",
    "about_speaker": "Vivek Kalyanarangan is a Data Scientist with 4+ years of hands on experience in Machine Learning Tools like Python, Tensorflow, Spark, R, Elasticsearch etc. He has worked across domains mainly in Healthcare and Travel and Hospitality. He wishes to make a trilingual contribution to the industry – Technology, Business, Analytics.\n\nTeam UNP has guided many students to embark on their maiden flight beyond the Horizons of Analytics.",
    "description": "The talk will give a brief introduction to Dockers, followed by coding examples for docker containers, building Machine Learning based micro services, and deploying on premise server and cloud.",
    "duration": "50 minutes",
    "github": "https://github.com",
    "image": "https://media-exp1.licdn.com/media/p/6/005/0b0/0e6/30e945b.jpg",
    "linkedin": "https://in.linkedin.com/in/vivekkalyanarangan",
    "location": "NLH 203",
    "speaker": "Vivek Kalyanarangan (Team UNP)",
    "speaker_email": "reachoutunp@gmail.com",
    "talk_id": "teamunip",
    "title": "Deploy Machine Learning apps using Docker",
    "type": "Track One"
  },
  {
    "about_speaker": "Dheeraj Rajagopal is first year PhD student at the Language Technologies Institute at Carnegie Mellon University. He works with Prof. Eduard Hovy on Natural Language Processing, specifically Semantics and Knowledge Representation and Reasoning from a Deep Learning perspective for Modeling. He worked as a Research Engineer in National University of Singapore from 2012-2014 and a Research Engineer at A*STAR IHPC for 2014-2015. During his bachelor's at Vellore Institute of Technology, he worked on Information Extraction, specifically commonsense knowledge Extraction.",
    "begin_time": "201710211730",
    "description": "Pytorch is one of the widely used Deep Learning libraries for tasks like Computer Vision, Natural Language Processing and Deep Reinforcement Learning. Deep learning libraries such as Pytorch are optimized for GPU computations, which speeds up matrix computations by a big factor. In this talk, he will talk about the basic building blocks of Pytorch, how to construct your first Deep Learning model, run a sample task and what tips/tricks you should follow when you enter the land of deep learning. Also, he will briefly go through the initial common pitfalls and best practices for building your deep learning system.",
    "duration": "30 minutes",
    "github": "https://github.com",
    "image": "https://media-exp1.licdn.com/media/AAEAAQAAAAAAAAd5AAAAJDYwZDFjNTdmLTc3MjctNGFjMC1iMDMyLWZiMzRkNjUyZWRhOQ.jpg",
    "linkedin": "https://www.linkedin.com/in/dheerajgopal",
    "location": "NLH 203",
    "speaker": "Dheeraj Rajagopal",
    "speaker_email": "dheeraj@cs.cmu.edu",
    "talk_id": "dheerajr",
    "title": "Deep Learning with PyTorch (Videocon)",
    "type": "Track One"
  },
  {
    "about_speaker": "Daniel J Evans is a full-stack developer, graduate student, and researcher at Carnegie Mellon University where he is employed in the rapid-prototyping of digital humanities projects. His interests lay in the computational analysis of the history of the book. Previously he worked in publishing where he negotiated text and data mining rights for researchers and produced digital archives. He holds a B.A. in History with a concentration in Russian and Eastern European Studies. ",
    "begin_time": "201710211800",
    "description": "Python, due to the ease with which it is learned and its versatility, is afforded wide sweeping popularity within the field of digital humanities. This talk will give an overview of the field as it evolved from humanities computing into its current form. It will also touch on the field’s history and a few ongoing projects, emphasizing the unique role python has played in broadening the horizons of the humanities.",
    "duration": "30 minutes",
    "github": "https://github.com",
    "image": "https://pbs.twimg.com/profile_images/544889184943484928/UC42xM2i_400x400.jpeg",
    "linkedin": "https://www.linkedin.com/in/danieljohnevans",
    "location": "NLH 203",
    "speaker": "Daniel J Evans",
    "speaker_email": "djevans@cmu.edu",
    "talk_id": "danevans",
    "title": "The Computational and the Humanities: Python in the Humanities (Videocon)",
    "type": "Track One"
  },
  {
    "about_speaker": "An optimist by nature, Naren shows up late to meetings at MadStreetDen. In his 4 years of industry experience he's worn plenty of hats- like the one of a Trainer, Embedded Engineer and Backend/Product Engineer and sometimes even helmets- when he's out cycling.\n\nHe is currently on a mission to help startups to design and write usable software even before making it reusable.\n\nWhen he’s not stirring up code, you can find him whipping up a delicious gluten-free treat or travelling/cycling.\n\nHe likes being asked about his endless love for coding through the handle @DudeWhoCode",
    "begin_time": "201710221200",
    "description": "Any task can be made embarassingly parallel with your code by crunching up the resources and using all CPU cores. What if your system resources are limited, say single core?, How do we achieve the similar speed in execution of tasks?.\n\nIn this talk we will discuss about how we can use Python3 to achieve near speed as in parallelism but without compromising system resources.\n\nAt the end of the talk the audience will know that concurrency is not parallelism and how to use achieve it.",
    "duration": "50 minutes",
    "github": "https://github.com/dudewhocode/",
    "image": "https://pbs.twimg.com/profile_images/902418087172907008/kFmv8EKj_400x400.jpg",
    "linkedin": "https://www.linkedin.com/in/dudewhocode/",
    "location": "NLH 103",
    "speaker": "Naren Ravi",
    "speaker_email": "narenravi92@gmail.com",
    "talk_id": "narenrav",
    "title": "Concurrency vs Parallelism",
    "type": "Track One"
  },
  {
    "about_speaker": "Ayodhyankit Paul is a student and a machine learning enthusiast. He has completed his Engineering this year, and is now preparing for higher study.\n\nHe is the creator and admin of Tensor Flow India group. He is also interested in Security and Hacking field and has found many vulnerabilities on the web.\n\nHe loves to play with neural networks and his main focus area is Unsupervised Learning.\n\nHe is also wordpress and php developer and completed 100+ ecommerce websites project as a freelancer developer.",
    "begin_time": "201710221100",
    "description": "Decorators belong most probably to the most beautiful and most powerful design possibilities in Python, but at the same time the concept is considered by many as complicated to get into.\n\nThis talk covers decorator from the basic to advanced uses including decorators in lambda (Anonymous function).\n\nThe goal of this talk is to explore decorators by methodically stepping through how and why they work. Along the way we'll touch on closures, scopes, nested function and how decorator internally works.\n\nAt the end of the workshop, the participants will be able to write decorators without any confusion, including the ones that take arguments.",
    "duration": "50 minutes",
    "github": "https://github.com/exepaul",
    "image": "http://www.pi-cube.com/wp-content/uploads/2015/04/team-placeholder.jpg",
    "linkedin": "https://www.linkedin.com/in/exepaul",
    "location": "NLH 103",
    "speaker": "Ayodhyankit Paul",
    "speaker_email": "ayodhyankit@gmail.com",
    "talk_id": "ayodanki",
    "title": "Journey to the Decorators World",
    "type": "Track One"
  },
  {
    "about_speaker": "Soumyadeep Ghosh is a student of MIT from batch of 2015, currently working as an engineer with PharmEasy.in. He is looking forward to get this esteemed opportunity to go back to my beloved alma mater and give something back to my juniors, as he had received in numerous events.",
    "begin_time": "201710221700",
    "description": "Microservices is an architecture used to develop multiple systems which are loosely coupled, but intra-connected enough at the same time to collectively serve one ultimate cause.\n\nDuring a session at MuPy, the following things will be covered:\n\n- What is a microservice?\n- How to connect multiple microservice?\n- How to maintain multiple microservices at the same time for one org?\n- When one should start building microservices?\n- Lastly, why one should consider not moving towards a microservices architecture?",
    "duration": "50 minutes",
    "github": "https://github.com/deep11194g",
    "image": "https://media-exp1.licdn.com/media/AAEAAQAAAAAAAA0lAAAAJDk5NjA1ZDBmLWUwOWMtNDhlZS1iNGU0LTEzYTUxNjU4ODZjYQ.jpg",
    "linkedin": "https://www.linkedin.com/in/soumyadeep-ghosh-38447694/",
    "location": "NLH 103",
    "speaker": "Soumyadeep Ghosh",
    "speaker_email": "soumyadeep11194@gmail.com",
    "talk_id": "soumyade",
    "title": "Microservices Architecture",
    "type": "Track One"
  },
  {
    "about_speaker": "Sailesh Sriram is of the founders of MUPy. After graduating from MIT, Manipal in 2017, he's working full time at Amazon, while also being a regular contributor to the world of open source.",
    "begin_time": "201710221500",
    "description": "Sailesh'll give a day by day break down on new things he learnt in one week.",
    "duration": "50 minutes",
    "github": "https://github.com/SaileshSriram",
    "image": "https://avatars1.githubusercontent.com/u/8988733?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/sailesh-sriram-473b5497/",
    "location": "NLH 105",
    "speaker": "Sailesh Sriram",
    "speaker_email": "saileshsriram572@gmail.com",
    "talk_id": "saileshs",
    "title": "What I learnt about Python in one week",
    "type": "Track Two"
  },
  {
    "about_speaker": "Kartik Mandaville is the founder of SpringRole Inc, and a senior Technical Advisor at Science-Inc, Handstand, Lenny and Burst.\n\nHe graduated from Carnegie Mellon University with Masters from the Language Technologies Institute, School of Computer Science, and is an alumni of MIT Manipal, 2012 batch.",
    "begin_time": "201710221000",
    "description": "A short story on how this new technology is shaping and moving beyond the bitcoin hype. In this talk, Kartik will attempt to reveal the principle behind Blockchain, its potential to defy current systems and why Blockchain is probably the biggest technological invention since the PC in the 1970s and the Internet in the 1990s.\n\nThe talk will cover the following points:\n- What is blockchain\n- Can blockchain replace internet\n- How to build dapps\n- Create your own cryptocurrency",
    "duration": "50 minutes",
    "github": "https://github.com/kar2905",
    "image": "https://avatars1.githubusercontent.com/u/92009?s=460&v=4",
    "linkedin": "https://www.linkedin.com/in/kar2905/",
    "location": "NLH 103",
    "speaker": "Kartik Mandaville",
    "speaker_email": "kartik@springrole.com",
    "talk_id": "kartmand",
    "title": "Block Chain and Crypto Currency",
    "type": "Track One"
  },
  {
    "about_speaker": "Yash Kumar Lal (YKL) is a 4th year CSE student who has dabbled in the field of Natural Language Processing. He is also one of the founders of PyPals and MUPy and stays active in the open source community.",
    "begin_time": "201710221600",
    "description": "Polysemy is the coexistence of many possible meanings for a word or phrase.\n\nThe talk would attempt to cover the following:\n- Word Representations\n- Distributional Semantics\n- GloVe and Word2Vec\nLimitations of unsupervised and statistical methods\n- Word Senses, Why not just use Word Sense disambiguation to distinguish between polysemous occurrences?\n- Possible approaches to handle polysemy\n- Concordance based approach",
    "duration": "50 minutes",
    "github": "https://github.com/ykl7",
    "image": "https://www.pypals.org/static/images/Yash.png",
    "linkedin": "https://www.linkedin.com/in/yash-kumar-lal-588187122/",
    "location": "NLH 103",
    "speaker": "Yash Kumar Lal",
    "speaker_email": "yklal95@gmail.com",
    "talk_id": "yashklal",
    "title": "Neural Embeddings for Polysemous Words",
    "type": "Track One"
  },
  {
    "about_speaker": "Lakshay is a first year student at MIT Manipal, author of various open source projects in Python and Go, such as MusicRepair and MIT-Hodor.",
    "begin_time": "201710221100",
    "description": "MIT Hodor is a messenger bot that tells you your attendance, timetable, etc through SLCM. I’ll be talking about how we went about building it, what made us build it and the problems that we faced along the way. I’ll outline each part in 5-7 minute chunks.\n\n\nOutreach:\n\n1 out of every 5 first year kids actively uses the bot.\n\nA lot of students want to know how the bot was built, hence the audience will be engaged and interested in the talk.\n\n\nMain topics:\n\n- Why I wanted to build it 5 mins\n\n- Why python was perfect for building it (explain the merits, etc) 5 mins\n\n- The tools I used to build it (Heroku, selenium, bs4, facebook’s API, etc) 10 mins\n\n- Explain how the bot works (Receive request, scrape, parse, etc) 10 minutes\n\n- The unique problems that we faced (Writing straight to db, etc) 10 mins\n\n\nSummary:\n\n\nOverall along the way I’ll be showing little code snippets that will also outline the best practices for python. (When to modularise, when not to), (When to use tuples, etc). All the examples will be very practical, hence easy for the audience to grasp.",
    "duration": "50 minutes",
    "github": "https://github.com/kalbhor",
    "image": "https://pbs.twimg.com/profile_images/840536894303756288/gq09gq4V_400x400.jpg",
    "linkedin": "https://www.linkedin.com/in/lakshay-kalbhor-07584a139/",
    "location": "NLH 105",
    "speaker": "Lakshay Kalbhor",
    "speaker_email": "lakshaykalbhor@gmail.com",
    "talk_id": "kalbhoro",
    "title": "MIT Hodor",
    "type": "Track Two"
  },
  {
    "about_speaker": "Anurag is a first year student at MIT, Manipal, and an opensource and freelance software developer. He has an experience of 5-6 years in programming\nwith Python. He took part in the Google Code In 2013-14 and 2014-15 competitions, and was\nselected as a Grand Prize winner both of the times.",
    "begin_time": "201710221000",
    "description": "The talk is about getting started with Open Source and RCS (Revision Control System). It will cover the following topics:\n\n- Modern web app development methods using python.\n- Brief intro on Django, Web2Py and Flask.\n- Model-View-Controller Architecture.\n- Python AsyncIO\n- Django Celery – Integrating asynchronous tasks in Django\n- Develop a simple Blog App as a demonstration.",
    "duration": "50 minutes",
    "github": "https://github.com/anurag-ks",
    "image": "https://avatars2.githubusercontent.com/u/3973075?s=460&v=4",
    "linkedin": "https://linkedin.com/",
    "location": "NLH 105",
    "speaker": "Anurag Sharma",
    "speaker_email": "anssharma61@gmail.com",
    "talk_id": "anuragks",
    "title": "Open Source Web Development and Python, Django, and Asynchronous Tasks",
    "type": "Track Two"
  },
  {
    "about_speaker": "Ronald is a 5th semester student at MIT Manipal, and is co-founder of Alexander Computing, which is working on an AI based job platform.\n\nHe was previously working as an AI member in Project Manas, He also serves as a mentor in Dronaid.",
    "begin_time": "201710221600",
    "description": "Cloud Computing is a generic term now, it’s basically renting server’s on the Internet and using them. According to different cloud-computing vendors, you get different types of services IaaS(Infrastructure as a Service, eg. AWS, Azure), PaaS(Platform as a Service, eg. Heroku) etc.\n\nThis may need to you know how to manage servers to a certain extent. Also, Your server won’t be doing computations always, but you have to pay for the time it was online.\n\nHere comes Serverless Architecture, that uses microservices(something like a function for almost everything, that your server was doing). It becomes a little complex breaking down an entire app into Microservices, but it saves the headache of managing servers and also you are only charged for the time your function was executing, while is very cheap compared to dedicated servers cost.\n\nPrerequisites:\n\nGeneral Idea of Cloud Computing (Would be better, if already worked with AWS EC2 or Lambda, HTTP Requests, Python and Programming Basics.",
    "duration": "50 minutes",
    "github": "https://github.com/ronalddas",
    "image": "https://avatars1.githubusercontent.com/u/12792689?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/ronald-das-616016b2/",
    "location": "NLH 105",
    "speaker": "Ronald Das",
    "speaker_email": "ronald1das@gmail.com",
    "talk_id": "ronaldas",
    "title": "Serverless Apps Using Python",
    "type": "Track Two"
  },
  {
    "about_speaker": "Ankush is the co-founder at Alexander Computing Private Limited, Former Automation Head at Project Manas, and a third year student at MIT, Manipal.",
    "begin_time": "201710221700",
    "description": "When we started programming back in first semester, all we did was finding factorial and fibonacci numbers. But as we continue to learn we start to learn what else we can do other than just doing boring matrix multiplications. I want to talk about​ ​automation​ and common​ ​lifehack​ which makes python an interesting language using concept of \"if this then that\".\n\nFew points covered in the talk:\n- Using Google Sheets API for automatic back up of data.\n- Automatic backup on S3 using BOTO3 for using aws services like S3 , Dynamodb etc",
    "duration": "50 minutes",
    "github": "https://github.com/ankode",
    "image": "https://avatars3.githubusercontent.com/u/20606950?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/aankush/",
    "location": "NLH 105",
    "speaker": "Ankush Anshuman",
    "speaker_email": "ankush3107@gmail.com",
    "talk_id": "ankushan",
    "title": "Lifehacks Using Python",
    "type": "Track Two"
  },
  {
    "about_speaker": "Ashwath Rao and Murlikrishna SN are senior scale assistant professors at MIT, Manipal, who are currently researching the field of Natural Language Processing.",
    "begin_time": "201710211630",
    "description": "Treebank is a major linguistic resource for various NLP tasks. The treebanks have proved to be a crucial resource for higher level NLP research and developing solutions for various socially relevant NLP applications. Under the administrative approval letter No. 11(12)/2012-HCC (TDIL) dated 29.07.2013 from Department of Electronics and Information Technology, New Delhi under the Ministry of Information and Communication Technology, treebank develop- ment for four indian langauges namely Kannada, Bengali, Marathi and Malayalam started with International Institute of Information Technology, Hyderabad as the lead institute. Kannada language treebank developmet was obtained by MIT Manipal. Bengali language development was carried out by Jadhavpur University, Marathi language was by IIT Mumbai, Malayalam by Centre for Development of Imaging Technology, Trivandrum.\n\nIn each of the language verticals about 160K words are tagged for Morphology, Part-of- Speech, Chunking, Dependency annotation. All these tasks are done by annotators. Annotators are trained for carrying out these tasks. Quality of treebank rests on the correct annotation of words. Manual verification of annotated data is a time consuming task. Development of valida- tion tools will reduce the human time in validation. MIT Manipal along with IIIT, Hyderabad have developed validation tools using Python for verification of Treebank. In this talk, we are going to share insight of validation tools.\n\nTopics Covered in the talk:\n- Checking for wx, UTF similarity\n- Representation of Shakti Standard Format blocks\n- Checking for Morph errors\n- Checking for Dependency cycles\n- Checking for Dependency errors",
    "duration": "50 minutes",
    "github": "https://github.com",
    "image": "http://mediaprocessor.websimages.com/width/130/crop/0,0,130x150/ashwath-rao.webs.com/Ashwath_Rao_B.jpg",
    "linkedin": "https://www.linkedin.com/in/ashwath-rao-09774418/",
    "location": "NLH 205",
    "speaker": "Ashwath Rao B and Murli Krishna SN",
    "speaker_email": "ashwath.rao@manipal.edu",
    "talk_id": "ashwmurl",
    "title": "Treebank validation using Python",
    "type": "Track Two"
  },
  {
    "about_speaker": "Aneesh is ML/DL enthusiast VR and Software Developer for Mars Society, and a final year student at MIT, Manipal, who loves training end to end networks.",
    "begin_time": "201710221200",
    "description": "The talk is about building an architecture to transfer one image's style to another.\n\nSimilar to ones used in the famous Prisma applications, the talk will start with a slight intro to Neural Networks and then the Optimisation behind style transfer, and provide an explanation with online demos.",
    "duration": "50 minutes",
    "github": "https://github.com/aneesh-joshi",
    "image": "https://avatars3.githubusercontent.com/u/14147383?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/aneesh-joshi-594602135/",
    "location": "NLH 105",
    "speaker": "Aneesh Joshi",
    "speaker_email": "aneeshyjoshi@gmail.com",
    "talk_id": "aneeshjo",
    "title": "Neural Style Transfer",
    "type": "Track Two"
  },
  {
    "about_speaker": "Pale and balding, one could easily mistake Siddharth Kothiyal (Siddy) for your standard, uninterested, bespectacled nerd. But when he is not busy screwing up his system with Windows installations, he experiments with Computer Vision with Python (among other things), gaining valuable experience on the front.",
    "begin_time": "201710221400",
    "description": "The talk will be about how important Python in the field of Machine Learning and Computer Vision, and what all it can be used for - from robotics to simple scripting.\n\nSiddharth will talk about computer vision and how Python plays a major role in the CV industry.",
    "duration": "50 minutes",
    "github": "https://github.com/sidkothiyal",
    "image": "https://avatars2.githubusercontent.com/u/15217079?s=400&v=4",
    "linkedin": "https://www.linkedin.com/in/siddharth-kothiyal-30153abb/",
    "location": "NLH 105",
    "speaker": "Siddharth Kothiyal",
    "speaker_email": "sid.kothiyal27@gmail.com",
    "talk_id": "sidkotho",
    "title": "Python in the Field of Image Processing and Computer Vision",
    "type": "Track Two"
  }
]